Revit 2027 API
EnergyDataSettings.CheckBuildingType Method
 Checks that the building type falls within an appropriate range.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CheckBuildingType(
	gbXMLBuildingType buildingType
)
Public Shared Function CheckBuildingType (
	buildingType As gbXMLBuildingType
) As Boolean
public:
static bool CheckBuildingType(
	gbXMLBuildingType buildingType
)
static member CheckBuildingType :
        buildingType : gbXMLBuildingType -> bool
Parameters
buildingType gbXMLBuildingType
 The building type to be checked.
Return Value
Boolean
 True if the building type falls within an appropriate range, false otherwise.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace